import Navbar from '../Navbar/Navbar';
import './About.css';
const About = () => {
    return (
        <div className='whole'>
        <Navbar />
        <div className='about-container'>
        <div className='box'>
            <h2>Temple History</h2>
            <p>ఈ దేవాలయము గత 80 సంవత్సరాల పూర్వము మఱ్ఱి చెట్టు కింద ఆంజనేయస్వామి రావి చెట్టు కింద పరమేశ్వరుడు లింగ రూపంలో మెలిసి పూజలు అందుకునేవారు. అట్టి దేవాలయం మోతీ నగర్ అవంతి నగర్ కబీర్ నగర్ వాసుల సహకారంతో దేవాలయం వైభవంగా గత రెండు సంవత్సరాల క్రితం పూర్తి రాతి కట్టడంతో నిర్మాణం గావించబడినది దేవాలయంలో దాసాంజనేయ సహిత సీతారామచంద్రస్వామి గారు మరియు శివపరివారము గణపతి సుబ్రహ్మణ్యం కాలభైరవ సమేతంగా ప్రతిష్ట గావింపబడి పూజలు అందుకుంటుంది మన ప్రాంతంలో ఉన్న ఏకైక ద్రవిడ సాంప్రదాయ రామచంద్రస్వామి మరియు లలితా పరమేశ్వరి కాలభైరవ స్వామి దేవాలయంలో కొలువుదీరినారు. రావి చెట్టు మర్రిచెట్టు ఉసిరి చెట్టు వేపచెట్టు కలిసి ఉండటం ఇక్కడ విశేషం.</p>
        </div>
        <div className='box'>
            <h2>About Ayyagaru</h2>
            <p>ఈ దేవాలయంలో ప్రధాన అర్చకులుగా ఆరుట్లఆచార్య  శ్రీనాథ్ బాధ్యతలునిర్వహిస్తున్నారు. వీరు వంశపారంపర్యంగా గత 25 సంవత్సరాలుగా  అర్చక వృత్తిని నిర్వహిస్తూ శ్రీ శ్రీ శ్రీ  త్రిదండి రామచంద్ర రామానుజ స్వామి జీయర్ స్వామి వారి ప్రతిష్ట  యాగ్నిక బృందంలో సభ్యునిగా ఉండి సుమారు 40 మహా ప్రతిష్టలలో భాగస్వాములు అయినారు. పురోహిత్యములో వివాహాo గృహప్రవేశాది  సమస్త శుభ కార్యములు దేవత ప్రతిష్టలు నిర్వహించగలరు.</p>
        </div>
        <div className='box'>
            <h2>What we do</h2>
            <p>మన దేవాలయం లో సోమవారం పరమేశ్వరునికి రుద్రాభిషేకాలు మహాన్యాస పూర్వకంగా నిర్వహించబడును ప్రతి మాస శివరాత్రి రోజున ప్రదోషకాల పూజలు శివ కళ్యాణం నిర్వహించబడును 
 మంగళవారం 
వల్లి దేవసేన సమేత సుబ్రహ్మణ్య స్వామి వారికి పంచామృత అభిషేకము 
 షష్టి సందర్భంగా నాగదోష పరిహారము రాహుకేతు దోష పరిహారము కుజదోష పరిహారము కళ్యాణము నిర్వహించబడును. 
 బుధవారం
విజయ గణపతి స్వామి వారికి విశేష కలశ అభిషేకములు జరుగును విద్యార్థులకు ప్రత్యేకంగా జ్ఞాపకశక్తి కొరకు ప్రత్యేక పూజలు నిర్వహించబడును సంకటహర చతుర్థి రోజున సాయంత్రం వారికి విశేష పూజలు జరుగును 
 గురువారం
దేవాలయంలో  ద్రవిడ సాంప్రదాయంలో కొలువుదీరిన శ్రీ సీతా లక్ష్మణ సమేత రామచంద్రస్వామి వారికి విశేషా అలంకారం జరిపి అర్చన జరుపబడును ప్రతి పునర్వసు ఏకాదశి నందు అభిషేకాలు కళ్యాణ మహోత్సవం జరుగును 
 శుక్రవారం
లలితా పరమేశ్వరి అమ్మవారికి ప్రతి శుక్రవారం 
 అభిషేకం జరుగును 
అనంతరం రాహుకాల పూజ జరుపబడును సాయంత్రము కుంకుమార్చన లలితా సహస్రనామ పారాయణంతో జరుపబడును
 శనివారం
దక్షిణ ముఖంగా పిలిచిన శ్రీ శ్రీ దాసాంజనేయ స్వామి వారికి స్వామి వారికి విశేష కైంకర్య సేవలు జరుగును నాగవల్లి దళార్చనలు వడమాల సేవలు పుష్పమాల సేవలు అష్టోత్తర శతనామార్చనలు జరుగును
సాయంత్రం విశేష హారతులు మరియు వివిధ రకాల  నైవేద్యాలు సమర్పించబడును 
 ఆదివారం
ప్రాంతంలో ఎక్కడా లేని విధంగా కాలభైరవ స్వామి ప్రత్యంగిరా సమీతుడై మన దేవాలయంలో కొలువుదీరి ఉన్నాడు ఈ స్వామికి ప్రీతిగా తైలాభిషేకాలు మరియు బస్మాభిషేకాలు పంచామృతాభిషేకాలు ప్రతిఆష్టమి  రోజు సరోజన అమావాస్య రోజు నిర్వహించి కూష్మాండ దీప అర్చన నిర్వహించబడును. ఇవి కాక నవగ్రహాలు కూడా మన దేవాలయంలో కొలువు దీరీ ఉన్నాయి.</p>
        </div>
         <div className='box'>
            <h2>Designer</h2>
            <p>This Website is Design By Arutla Sai Kalyan, Here is My Information, Mail : kalyan.arutla@gmail.com || Mobile Number : 8919098112</p>
        </div>
        </div>
        </div>
    );
}

export default About;
